Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.GetCurrentElements
Returns the list of Ids of the current elements.
Returns:
Ids of the current elements. Contains the family base element to which the section shape type parameter belongs.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.Document
The current document.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSectionsServiceData
The data needed by section type server to perform type definition.
Since:
2015